app/views/users/show.html.erb

      <% if chat.sender_id == @user.id %>
        <%= User.find(chat.receiver_id).first_name %> <%= User.find(chat.receiver_id).last_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = 41 LIMIT 1