app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats"
SELECT COUNT(*) FROM "chats"
---
  def index
    @chats = Chat.all
    puts "DEBUG: Número de chats encontrados: #{@chats.count}"

SELECT "chats".* FROM "chats" WHERE "chats"."id" = 1 LIMIT 1
SELECT "messages".* FROM "messages" WHERE "messages"."chat_id" = 1
---
  def show
    @chat = Chat.find(params[:id])
    @messages = Message.where(chat_id: @chat.id)