app/controllers/messages_controller.rb

  def index
    @messages = Message.all
    puts "DEBUG: Número de mensajes encontrados: #{@messages.count}"
---
SELECT "messages".* FROM "messages"
SELECT COUNT(*) FROM "messages"