app/controllers/users_controller.rb

  def index
    @users = User.includes(:messages).all
    puts "DEBUG: Número de usuarios encontrados: #{@users.count}"
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "users"